<script lang="ts" setup>
    import { MainFlexWrapper, Container } from '~/components';
    import SecondTitle from "./SecondTitle.vue";
    import Text from "./Text.vue";
    import List from "./List.vue";
</script>
<template>
    <MainFlexWrapper class="bg-[#292929] text-white pt-[300px] md:pt-[180px] pb-[30px] text-xl">
        <Container>
                <h1 class="text-2xl md:text-4xl font-bold mb-[30px]">
                    Политика конфиденциальности в отношении обработки персональных данных
                </h1>
                <SecondTitle>
                    1. Общие положения
                </SecondTitle>
                <Text>
                    Настоящая политика обработки персональных данных составлена в 
                    соответствии с требованиями Федерального закона от 27.07.2006. № 152-ФЗ 
                    «О персональных данных» (далее – Закон о персональных данных) и 
                    определяет порядок обработки персональных данных и меры по обеспечению 
                    безопасности персональных данных, предпринимаемые <b class="underline">Администратором 
                    ресурса.</b>
                </Text>
                <Text>
                    1.1. Администратор ставит своей важнейшей целью и условием 
                    осуществления своей деятельности соблюдение прав и свобод человека и 
                    гражданина при обработке его персональных данных, в том числе защиты 
                    прав на неприкосновенность частной жизни, личную и семейную тайну.
                </Text>
                <Text>
                    1.2. Настоящая политика конфиденциальности в отношении обработки 
                    персональных данных (далее – Политика) применяется ко всей информации, 
                    которую Оператор может получить о посетителях веб-сайта 
                    https://marketplace-helper.ru/.
                </Text>
                <SecondTitle>
                    2. Основные понятия, используемые в Политике
                </SecondTitle>
                <Text>
                    <b>2.1. Автоматизированная обработка персональных данных –</b> 
                    обработка персональных данных с помощью средств вычислительной 
                    техники.
                </Text>
                <Text>
                    <b>
                        2.2. Блокирование персональных данных –
                    </b>
                    временное прекращение 
                    обработки персональных данных (за исключением случаев, если обработка 
                    необходима для уточнения персональных данных).
                </Text>
                <Text>
                    <b>
                        2.3. Веб-сайт – 
                    </b>
                    совокупность графических и информационных 
                    материалов, а также программ для ЭВМ и баз данных, обеспечивающих их 
                    доступность в сети интернет по сетевому адресу https://marketplace-helper.ru/.
                </Text>
                <Text>
                    <b>
                        2.4. Информационная система персональных данных – 
                    </b>
совокупность содержащихся в базах данных персональных данных и 
обеспечивающих их обработку информационных технологий и технических 
средств.
                </Text>
                <Text>
                    <b>
                        2.5. Обезличивание персональных данных – 
                    </b>
                    действия, в результате 
которых невозможно определить без использования дополнительной 
информации принадлежность персональных данных конкретному 
Пользователю или иному субъекту персональных данных.
                </Text>
                <Text>
                    <b>
                        2.6. Обработка персональных данных – 
                    </b>
                    любое действие (операция) 
или совокупность действий (операций), совершаемых с использованием 
средств автоматизации или без использования таких средств с 
персональными данными, включая сбор, запись, систематизацию, 
накопление, хранение, уточнение (обновление, изменение), извлечение, 
использование, передачу (распространение, предоставление, доступ), 
обезличивание, блокирование, удаление, уничтожение персональных данных.
                </Text>
                <Text>
                    <b>
                        2.7. Администратор – 
                    </b>
                    физическое лицо, самостоятельно или 
совместно с другими лицами организующие и/или осуществляющие 
обработку персональных данных, а также определяющие цели обработки 
персональных данных, состав персональных данных, подлежащих обработке, 
действия (операции), совершаемые с персональными данными.
                </Text>
                <Text>
                    <b>
                        2.8. Персональные данные – 
                    </b>
                    любая информация, относящаяся прямо 
или косвенно к определенному Пользователю веб-сайта https://marketplace-
helper.ru/.
                </Text>
                <Text>
                    <b>
                        2.9. Персональные данные, разрешенные субъектом персональных 
                        данных для распространения – 
                    </b>
персональные данные, доступ к которым 
предоставлен субъектом персональных данных путем дачи согласия на 
обработку персональных данных, предусмотренных Законом о персональных 
данных (далее – персональные данные, разрешенные для распространения).
                </Text>
                <Text>
                    <b>
                        2.10. Пользователь – 
                    </b>
                    любой посетитель веб-сайта https://marketplace-helper.ru/.
                </Text>
                <Text>
                    <b>
                        2.11. Предоставление персональных данных – 
                    </b>
                    действия, 
направленные на раскрытие персональных данных определенному лицу или 
определенному кругу лиц.
                </Text>
                <Text>
                    <b>
                        2.12. Распространение персональных данных – 
                    </b>
                    любые действия, 
направленные на раскрытие персональных данных неопределенному кругу 
лиц (передача персональных данных) или на ознакомление с персональными 
данными неограниченного круга лиц, в том числе обнародование 
персональных данных в средствах массовой информации, размещение в 
информационно-телекоммуникационных сетях или предоставление доступа к 
персональным данным каким-либо иным способом.
                </Text>
                <Text>
                    <b>
                        2.13. Уничтожение персональных данных – 
                    </b>
                    любые действия, в 
результате которых персональные данные уничтожаются безвозвратно с 
невозможностью дальнейшего восстановления содержания персональных 
данных в информационной системе персональных данных и/или 
уничтожаются материальные носители персональных данных.
                </Text>
                <SecondTitle>
                    3. Основные права и обязанности Администратора
                </SecondTitle>
                <Text>
                    <b>3.1. Администратор имеет право:</b>
                </Text>
                <List>
                    <li>
                        – получать от субъекта персональных данных достоверные информацию и/или документы, содержащие персональные данные;
                    </li>
                    <li>
                        – в случае отзыва субъектом персональных данных согласия на 
                        обработку персональных данных, а также, направления обращения с 
                        требованием о прекращении обработки персональных данных, 
                        Администратор вправе продолжить обработку персональных данных без 
                        согласия субъекта персональных данных при наличии оснований, указанных 
                        в Законе о персональных данных;
                    </li>
                    <li>
                        – самостоятельно определять состав и перечень мер, необходимых и 
                        достаточных для обеспечения выполнения обязанностей, предусмотренных 
                        Законом о персональных данных и принятыми в соответствии с ним 
                        нормативными правовыми актами, если иное не предусмотрено Законом о 
                        персональных данных или другими федеральными законами.
                    </li>
                </List>
                <Text>
                    <b>3.2. Администратор обязан:</b>
                </Text>
                <List>
                    <li>
                        – предоставлять субъекту персональных данных по его просьбе 
                        информацию, касающуюся обработки его персональных данных;
                    </li>
                    <li>
                        – организовывать обработку персональных данных в порядке, 
                        установленном действующим законодательством РФ;
                    </li>
                    <li>
                        – отвечать на обращения и запросы субъектов персональных данных и 
                        их законных представителей в соответствии с требованиями Закона о 
                        персональных данных;
                    </li>
                    <li>
                        – сообщать в уполномоченный орган по защите прав субъектов 
                        персональных данных по запросу этого органа необходимую информацию в 
                        течение 10 дней с даты получения такого запроса;
                    </li>
                    <li>
                        – публиковать или иным образом обеспечивать неограниченный доступ 
                        к настоящей Политике конфиденциальности в отношении обработки 
                        персональных данных;
                    </li>
                    <li>
                        – принимать правовые, организационные и технические меры для 
                        защиты персональных данных от неправомерного или случайного доступа к 
                        ним, уничтожения, изменения, блокирования, копирования, предоставления, 
                        распространения персональных данных, а также от иных неправомерных 
                        действий в отношении персональных данных;
                    </li>
                    <li>
                        – прекратить передачу (распространение, предоставление, доступ) 
                        персональных данных, прекратить обработку и уничтожить персональные 
                        данные в порядке и случаях, предусмотренных Законом о персональных 
                        данных;
                    </li>
                    <li>
                        – исполнять иные обязанности, предусмотренные Законом о 
                        персональных данных.
                    </li>
                </List>
                <SecondTitle>
                    4. Основные права и обязанности субъектов персональных данных
                </SecondTitle>
                <Text>
                    <b>
                        4.1. Субъекты персональных данных имеют право:
                    </b>
                </Text>
                <List>
                    <li>
                        – получать информацию, касающуюся обработки его персональных 
                        данных, за исключением случаев, предусмотренных федеральными законами. 
                    </li>
                    <li>
                        Сведения предоставляются субъекту персональных данных 
                    Администратором в доступной форме, и в них не должны содержаться 
                    персональные данные, относящиеся к другим субъектам персональных 
                    данных, за исключением случаев, когда имеются законные основания для 
                    раскрытия таких персональных данных. Перечень информации и порядок ее 
                    получения установлен Законом о персональных данных;
                    </li>
                    <li>
                        – требовать от оператора уточнения его персональных данных, их 
                        блокирования или уничтожения в случае, если персональные данные 
                        являются неполными, устаревшими, неточными, незаконно полученными 
                        или не являются необходимыми для заявленной цели обработки, а также 
                        принимать предусмотренные законом меры по защите своих прав;
                    </li>
                    <li>
                        – выдвигать условие предварительного согласия при обработке 
                        персональных данных в целях продвижения на рынке товаров, работ и услуг;
                    </li>
                    <li>
                        – на отзыв согласия на обработку персональных данных, а также, на 
                        направление требования о прекращении обработки персональных данных;     
                    </li>
                    <li>
                        – обжаловать в уполномоченный орган по защите прав субъектов 
                        персональных данных или в судебном порядке неправомерные действия или 
                        бездействие Администратора при обработке его персональных данных;
                    </li>
                    <li>
                        – на осуществление иных прав, предусмотренных законодательством 
                        РФ.
                    </li>
                </List>
                <Text>
                    <b>4.2. Субъекты персональных данных обязаны:</b>
                </Text>
                <List>
                    <li>
                        – предоставлять Администратору достоверные данные о себе;
                    </li>
                    <li>
                        – сообщать Администратору об уточнении (обновлении, изменении) 
своих персональных данных.
                    </li>
                </List>
                <Text>
                    <b>4.3.</b> Лица, передавшие Администратору недостоверные сведения о 
себе, либо сведения о другом субъекте персональных данных без согласия 
последнего, несут ответственность в соответствии с законодательством РФ.
                </Text>
                <SecondTitle>
                    5. Принципы обработки персональных данных
                </SecondTitle>
                <Text>
                    <b>5.1.</b> Обработка персональных данных осуществляется на законной и 
справедливой основе.
                </Text>
                <Text>
                    <b>5.2.</b> Обработка персональных данных ограничивается достижением 
конкретных, заранее определенных и законных целей. Не допускается 
обработка персональных данных, несовместимая с целями сбора 
персональных данных.
                </Text>
                <Text>
                    <b>5.3.</b> Не допускается объединение баз данных, содержащих 
персональные данные, обработка которых осуществляется в целях, 
несовместимых между собой.
                </Text>
                <Text>
                    <b>
                        5.4.
                    </b>
                    Обработке подлежат только персональные данные, которые 
отвечают целям их обработки.
                </Text>
                <Text>
                    <b>5.5.</b>
                    Содержание и объем обрабатываемых персональных данных 
соответствуют заявленным целям обработки. Не допускается избыточность 
обрабатываемых персональных данных по отношению к заявленным целям 
их обработки.
                </Text>
                <Text>
                    <b>
                        5.6.  
                    </b>
                    При обработке персональных данных обеспечивается точность 
персональных данных, их достаточность, а в необходимых случаях и 
актуальность по отношению к целям обработки персональных данных. 
Администратор принимает необходимые меры и/или обеспечивает их 
принятие по удалению или уточнению неполных или неточных данных.
                </Text>
                <Text>
                    <b>5.7.</b> Хранение персональных данных осуществляется в форме, 
позволяющей определить субъекта персональных данных, не дольше, чем 
этого требуют цели обработки персональных данных, если срок хранения 
персональных данных не установлен федеральным законом, договором, 
стороной которого, выгодоприобретателем или поручителем по которому 
является субъект персональных данных. Обрабатываемые персональные 
данные уничтожаются либо обезличиваются по достижении целей обработки 
или в случае утраты необходимости в достижении этих целей, если иное не 
предусмотрено федеральным законом.
                </Text>
                <SecondTitle>
                    6. Цели обработки персональных данных
                </SecondTitle>
                <div class="border-white border-[1px] border-solid text-sm md:text-xl mb-[20px]">
                    <div class="grid grid-cols-2 border-b-[1px] border-white border-solid">
                        <div class="border-r-[1px] border-white border-solid p-[5px] md:p-[10px]">
                            Цель обработки
                        </div>
                        <div class="border-r-[1px] border-white border-solid p-[10px]">
                            Предоставление доступа Пользователю к сервисам, информации и/или материалам, содержащимся на веб-сайте
                        </div>
                    </div>
                    <div class="grid grid-cols-2 border-b-[1px] border-white border-solid">
                        <div class="border-r-[1px] border-white border-solid p-[10px]">
                            Персональные данные
                        </div>
                        <div class="border-r-[1px] border-white border-solid p-[10px]">
                            Электронный адрес <br />
                            Ozon ключи: Client Id, Api Key <br />
                            Wb ключи: Header Api Key
                        </div>
                    </div>
                    <div class="grid grid-cols-2 border-b-[1px] border-white border-solid">
                        <div class="border-r-[1px] border-white border-solid p-[10px]">
                            Правовые основания
                        </div>
                        <div class="border-r-[1px] border-white border-solid p-[10px]">
                            Федеральный закон «Об информации, информационных технологиях и о защите информации» от 27.07.2006 N 149-ФЗ
                        </div>
                    </div>
                    <div class="grid grid-cols-2 border-b-[1px] border-white border-solid">
                        <div class="border-r-[1px] border-white border-solid p-[10px]">
                            Виды обработки персональных данных
                        </div>
                        <div class="border-r-[1px] border-white border-solid p-[10px]">
                            Сбор, запись, систематизация, накопление, хранение, уничтожение и обезличивание персональных данных
                        </div>
                    </div>
                </div>
                <SecondTitle>
                    7. Условия обработки персональных данных
                </SecondTitle>
                <Text>
                    <b>
                        7.1.
                    </b>
                    Обработка персональных данных осуществляется с согласия 
                    субъекта персональных данных на обработку его персональных данных.
                </Text>
                <Text>
                    <b>
                        7.2.
                    </b>
                    Осуществляется обработка персональных данных, доступ 
неограниченного круга лиц к которым предоставлен субъектом 
персональных данных либо по его просьбе (далее – общедоступные 
персональные данные).
                </Text>
                <Text>
                    <b>
                        7.3.
                    </b>
                    Осуществляется обработка персональных данных, подлежащих 
опубликованию или обязательному раскрытию в соответствии с 
федеральным законом.
                </Text>
                <SecondTitle>
                    8. Порядок сбора, хранения, передачи и других видов обработки 
персональных данных
                </SecondTitle>
                <Text>
                    Безопасность персональных данных, которые обрабатываются 
Администратором, обеспечивается путем реализации правовых, 
организационных и технических мер, необходимых для выполнения в 
полном объеме требований действующего законодательства в области 
защиты персональных данных.
                </Text>
                <Text>
                    <b>
                        8.1.
                    </b>
                    Администратор обеспечивает сохранность персональных данных и 
принимает все возможные меры, исключающие доступ к персональным 
данным неуполномоченных лиц.
                </Text>
                <Text>
                    <b>
                        8.2.
                    </b>
                    Персональные данные Пользователя никогда, ни при каких 
условиях не будут переданы третьим лицам, за исключением случаев, 
связанных с исполнением действующего законодательства либо в случае, 
если субъектом персональных данных дано согласие Администратору на 
передачу данных третьему лицу для исполнения обязательств по гражданско-
правовому договору.
                </Text>
                <Text>
                    <b>
                        8.3.
                    </b>
                    В случае выявления неточностей в персональных данных, 
Пользователь может актуализировать их самостоятельно, путем направления 
Администратору уведомление на адрес электронной почты 
marketplacehelpercall@gmail.com с пометкой «Актуализация персональных 
данных».
                </Text>
                <Text>
                    <b>
                        8.4.
                    </b>
                    Срок обработки персональных данных определяется достижением 
целей, для которых были собраны персональные данные, если иной срок не 
предусмотрен договором или действующим законодательством.
                </Text>
                <Text>
                    предусмотрен договором или действующим законодательством.
Пользователь может в любой момент отозвать свое согласие на 
обработку персональных данных, направив Администратору уведомление 
посредством электронной почты на электронный адрес 
marketplacehelpercall@gmail.com с пометкой «Отзыв согласия на обработку 
персональных данных».
                </Text>
                <Text>
                    <b>
                        8.5.
                    </b>
                    Вся информация, которая собирается сторонними сервисами, в том 
числе платежными системами, средствами связи и другими поставщиками 
услуг, хранится и обрабатывается в соответствии с их Пользовательским 
соглашением и Политикой конфиденциальности. Администратор не несет 
ответственность за действия третьих лиц.
                </Text>
                <Text>
                    <b>
                        8.6.
                    </b>
                    Установленные субъектом персональных данных запреты на 
передачу (кроме предоставления доступа), а также на обработку или условия 
обработки (кроме получения доступа) персональных данных, разрешенных 
для распространения, не действуют в случаях обработки персональных 
данных в государственных, общественных и иных публичных интересах, 
определенных законодательством РФ.
                </Text>
                <Text>
                    <b>
                        8.7.
                    </b>
                    Администратор при обработке персональных данных обеспечивает 
конфиденциальность персональных данных.
                </Text>
                <Text>
                    <b>
                        8.8.
                    </b>
                    Администратор осуществляет хранение персональных данных в 
форме, позволяющей определить субъекта персональных данных, не дольше, 
чем этого требуют цели обработки персональных данных, если срок 
хранения персональных данных не установлен федеральным законом, 
договором, стороной которого, выгодоприобретателем или поручителем по 
которому является субъект персональных данных.
                </Text>
                <Text>
                    <b>
                        8.9.
                    </b>
                    Условием прекращения обработки персональных данных может 
являться достижение целей обработки персональных данных, истечение 
срока действия согласия субъекта персональных данных, отзыв согласия 
субъектом персональных данных или требование о прекращении обработки 
персональных данных, а также выявление неправомерной обработки 
персональных данных.
                </Text>
                <SecondTitle>
                    9. Перечень действий, производимых Администратором с 
полученными персональными данными
                </SecondTitle>
                <Text>
                    <b>
                        9.1.
                    </b>
                    Администратор осуществляет сбор, запись, систематизацию, 
накопление, хранение, уточнение (обновление, изменение), извлечение, 
использование, передачу (распространение, предоставление, доступ), 
обезличивание, блокирование, удаление и уничтожение персональных 
данных.
                </Text>
                <Text>
                    <b>
                        9.2.
                    </b>
                    Администратор осуществляет автоматизированную обработку 
персональных данных с получением и/или передачей полученной 
информации по информационно-телекоммуникационным сетям или без 
таковой.
                </Text>
                <SecondTitle>
                    10. Конфиденциальность персональных данных
                </SecondTitle>
                <Text>
                    Администратор и иные лица, получившие доступ к персональным 
данным, обязаны не раскрывать третьим лицам и не распространять 
персональные данные без согласия субъекта персональных данных, если 
иное не предусмотрено федеральным законом, а также не использовать их в 
целях собственной выгоды.
                </Text>
                <SecondTitle>
                    11. Заключительные положения
                </SecondTitle>
                <Text>
                    <b>
                        11.1.
                    </b>
                    Пользователь может получить любые разъяснения по 
интересующим вопросам, касающимся обработки его персональных данных, 
обратившись к Администратору с помощью электронной почты 
marketplacehelpercall@gmail.com.
                </Text>
                <Text>
                    <b>
                        11.2.
                    </b>
                    В данном документе будут отражены любые изменения политики 
обработки персональных данных Администратором. Политика действует 
бессрочно до замены ее новой версией.
                </Text>
                <Text>
                    <b>
                        11.3.
                    </b>
                    Актуальная версия Политики в свободном доступе расположена в 
сети Интернет по адресу https://marketplace-helper.ru/privacy/.
                </Text>
        </Container>
    </MainFlexWrapper>
</template>